---
title: MEPAnalyticalNode
classe: Autodesk.Revit.DB.Analysis.MEPAnalyticalNode
namespace: Autodesk.Revit.DB.Analysis
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 7
---

# MEPAnalyticalNode

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Int32 Id { get; }` | `mEPAnalyticalNode.Id` | Int32 |
| `Boolean IsFlowBlocked { get; }` | `mEPAnalyticalNode.IsFlowBlocked` | Boolean |
| `Boolean IsFocalNode { get; }` | `mEPAnalyticalNode.IsFocalNode` | Boolean |
| `Boolean IsValidObject { get; }` | `mEPAnalyticalNode.IsValidObject` | Boolean |
| `XYZ Location { get; }` | `mEPAnalyticalNode.Location` | XYZ |
| `Void Dispose()` | `mEPAnalyticalNode.Dispose()` | Void |
| `Boolean IsSameNode(MEPAnalyticalNode)` | `mEPAnalyticalNode.IsSameNode(other)` | Boolean |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```